# AllLevelsDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LevelAssociationFailures..::..AllLevelsDeleted Property
BuiltInFailures..::..LevelAssociationFailures Class See Also
---
All Levels from model were deleted
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AllLevelsDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllLevelsDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AllLevelsDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LevelAssociationFailures Class
Autodesk.Revit.DB Namespace